Autodesk.Revit.DB.FDXLogVerbosity
Since:
2024
An enumeration of log verbosity levels for FDX remote exchange.
Since:
2024

Autodesk.Revit.DB.FDXLogVerbosity.All
Log all FDX communication and fulfillment statistics. Use only for diagnostic purposes.

Autodesk.Revit.DB.FDXLogVerbosity.Errors
In addition to timed statistics, also log all failed requests and responses in their entirety.

Autodesk.Revit.DB.FDXLogVerbosity.TimedStatistics
In addition to basic statistics, also log timing breakdown of requests and events.

Autodesk.Revit.DB.FDXLogVerbosity.Statistics
Log basic information about fulfillment and data sent.

Autodesk.Revit.DB.FDXLogVerbosity.None
No logging output